      *> MY HELLO WORLD IN COBOL HELL YEAH!
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
           DISPLAY "SALVE, SIMPATIA! :)".
           STOP RUN.