      ************************************************************************
      * Author: Nathan Ranna
      * Date:
      * Purpose:
      * Tectonic:
      ************************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG007.
      ************************************************************************
       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
      ************************************************************************
       DATA DIVISION.

       FILE SECTION.
       WORKING-STORAGE SECTION.
      ************************************************************************
       PROCEDURE DIVISION.

       000-HELLO-WORLD.
      *
           DISPLAY "SALVE SIMPATIA.".
           STOP RUN.
      *
